/*  ===========================================================================================================
 *  Atlassource: base.js v1.0.1
 *  ===========================================================================================================
 *  Copyright 2014-2020 AFI.
 *  http://www.altassource.com
 *  ======================================================================================================== */

/*  -----------------------------------------------------------------------------------------------------------
    Variables
    ===========================================================================================================
*/
	var $light_box = $(".light_box"),
		$width_img = $(".modal > img").width(),
		$height_img = $(".modal > img").height(),
		$modal = $(".modal");

/*  -----------------------------------------------------------------------------------------------------------
    Multiple functions
    ===========================================================================================================
*/

/*  -----------------------------------------------------------------------------------------------------------
    JS Default */

	$(function(){

		/* Script da Index
		---------------------------------------------------------------------------------------------------- */
		$light_box.css({ opacity: 0.95 }).hide();

		$(".click_light").click(function(){
			$light_box.fadeIn();
			
			$light_box.click(function(){
				$light_box.fadeOut();
			});
		});

		/* ====================================================================================================
		 * FUNÇÃO: Verifica tamanho da imagem:
		 * ----------------------------------------------------------------------------------------------------
		 * Se a imagem for maior que 350px ela divide o tamanho por 2 e multiplica por -1 para deixar negativo;
		 * Após essa função ela refefine o posicionamento da imagem de acordo com o tamanho da mesma;
		 * Caso ela não seja maior que 350 o modal continua com seu tamanho default.
		 * ================================================================================================= */
		if($width_img > 350){
			var $size_width_img = ($width_img/2)*-1,
				$size_height_img = ($height_img/2)*-1;

			$modal
			.css("margin-left", $size_width_img)
			.css("margin-top", $size_height_img);
		} else {
			$modal
			.css("min-width", 350)
			.css("min-height", 250);
		}
	});